-- 청해진 대학 IT 과정 중간 테스트 1차 : SQL
-- 파일명 : 이름(한글로)test01.sql 
/*
전공 :                         
이름 :
학년 :
*/

-- emp테이블에서
--1.	모든 직원의 사번, 이름, 직무, 급여를 조회하시오. 

--2.	매니저가 있는 직원의 사번, 이름, 매니저 사번을 조회하시오.

--3.	모든 직원에 대하여, 사번, 이름, 급여, 연 급여를 조회하시오.

--4.	30번 부서 소속인 직원의 사번, 이름, 부서번호를 조회하시오.

--5.	급여가 2000 ~ 4000 사이인 직원의 사번, 이름, 급여를 조회하시오.

--6.	수당을 받는 직원의 사번, 이름, 수당을 조회하시오.

--7.	전직원의 급여가 10% 인상된 상황을 가정하고, 
--      현재 급여로부터 10% 인상된 급여를 구하여 
--      사번, 이름, 원급여, 총인상급여 네 가지를 조회하시오.

--8.	10번 부서 소속인 직원에 대하여 급여가 15% 인상된 상황을 가정하고, 
--      현재 급여로부터 15%인상된 급여를 구하여 
--      사번, 이름, 원급여, 인상분, 총인상급여, 부서번호 를 조회하시오.

--9.	모든 직원에 대하여 원급여는 2500 이하이고
--      15% 인상된 급여는 2800이 넘는 직원의 
--      사번, 이름, 원급여, 총인상급여, 부서번호를 조회하시오.



--10.	이름에 E가 들어가는 직원의 사번, 이름을 조회하시오.



--dept 테이블에서
--1.	BOSTON 에 위치한 부서의 모든 정보를 조회하시오.


--2.	DALLAS, NEW YORK 에 위치한 부서의 모든 정보를 조회하시오.

